zzshm-tech/tbox/SM_T_GB4_STM32F4_HJ1322/bsp/stm32f4xx-HAL/drivers/drv_gpio.c
/*
 * Copyright (c) 2006-2018, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author            Notes
 * 2017-10-20     ZYH            the first version
 */
#include <rthw.h>
#include <rtdevice.h>
#include <board.h>

#include "drv_gpio.h"


#ifdef RT_USING_PIN
#define __STM32_PIN(index, gpio, gpio_index) (gpio | gpio_index)
#define __STM32_PIN_DEFAULT 0

#define A   (1U << 8)
#define B   (2U << 8)
#define C   (3U << 8)
#define D   (4U << 8)
#define E   (5U << 8)
#define F   (6U << 8)
#define G   (7U << 8)
#define H   (8U << 8)
#define I   (9U << 8)
#define J   (10U << 8)
#define K   (11U << 8)

static GPIO_TypeDef * get_st_gpio(rt_uint16_t gpio_pin)
{
    switch(gpio_pin & 0xFF00)
    {
    case A:
        #ifdef GPIOA
        return GPIOA;
        #endif
    case B:
        #ifdef GPIOB
        return GPIOB;
        #endif
    case C:
        #ifdef GPIOC
        return GPIOC;
        #endif
    case D:
        #ifdef GPIOD
        return GPIOD;
        #endif
    case E:
        #ifdef GPIOE
        return GPIOE;
        #endif
    case F:
        #ifdef GPIOF
        return GPIOF;
        #endif
    case G:
        #ifdef GPIOG
        return GPIOG;
        #endif
    case H:
        #ifdef GPIOH
        return GPIOH;
        #endif
    case I:
        #ifdef GPIOI
        return GPIOI;
        #endif
    case J:
        #ifdef GPIOJ
        return GPIOJ;
        #endif
    case K:
        #ifdef GPIOK
        return GPIOK;
        #endif
    default:
        return RT_NULL;
    }
}

#define get_st_pin(gpio_pin) (0x01 << (gpio_pin&0xFF))

static void drv_clock_enable(rt_uint16_t gpio_pin)
{
    switch(gpio_pin & 0xFF00)
    {
    case A:
        #ifdef __HAL_RCC_GPIOA_CLK_ENABLE
        __HAL_RCC_GPIOA_CLK_ENABLE();
        #endif
        break;
    case B:
        #ifdef __HAL_RCC_GPIOB_CLK_ENABLE
        __HAL_RCC_GPIOB_CLK_ENABLE();
        #endif
        break;
    case C:
        #ifdef __HAL_RCC_GPIOC_CLK_ENABLE
        __HAL_RCC_GPIOC_CLK_ENABLE();
        #endif
        break;
    case D:
        #ifdef __HAL_RCC_GPIOD_CLK_ENABLE
        __HAL_RCC_GPIOD_CLK_ENABLE();
        #endif
        break;
    case E:
        #ifdef __HAL_RCC_GPIOE_CLK_ENABLE
        __HAL_RCC_GPIOE_CLK_ENABLE();
        #endif
        break;
    case F:
        #ifdef __HAL_RCC_GPIOF_CLK_ENABLE
        __HAL_RCC_GPIOF_CLK_ENABLE();
        #endif
        break;
    case G:
        #ifdef __HAL_RCC_GPIOG_CLK_ENABLE
        __HAL_RCC_GPIOG_CLK_ENABLE();
        #endif
        break;
    case H:
        #ifdef __HAL_RCC_GPIOH_CLK_ENABLE
        __HAL_RCC_GPIOH_CLK_ENABLE();
        #endif
        break;
    case I:
        #ifdef __HAL_RCC_GPIOI_CLK_ENABLE
        __HAL_RCC_GPIOI_CLK_ENABLE();
        #endif
        break;
    case J:
        #ifdef __HAL_RCC_GPIOJ_CLK_ENABLE
        __HAL_RCC_GPIOJ_CLK_ENABLE();
        #endif
        break;
    case K:
        #ifdef __HAL_RCC_GPIOK_CLK_ENABLE
        __HAL_RCC_GPIOK_CLK_ENABLE();
        #endif
        break;
    default:
        break;
    }
}

/* STM32 GPIO driver */
static const rt_uint16_t pins[] =
{
#if (STM32F4xx_PIN_NUMBERS == 36)
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(2, A, 15),
    __STM32_PIN(3, B, 5),
    __STM32_PIN(4, B, 8),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(8, A, 14),
    __STM32_PIN(9, B, 6),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(12, C, 14),
    __STM32_PIN(13, A, 13),
    __STM32_PIN(14, B, 3),
    __STM32_PIN(15, B, 7),
    __STM32_PIN(16, C, 13),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(18, C, 15),
    __STM32_PIN(19, A, 8),
    __STM32_PIN(20, A, 12),
    __STM32_PIN(21, B, 4),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(25, B, 12),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(27, B, 10),
    __STM32_PIN(28, A, 2),
    __STM32_PIN(29, A, 0),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(33, B, 2),
    __STM32_PIN(34, B, 5),
    __STM32_PIN(35, A, 3),
    __STM32_PIN_DEFAULT,
#endif
#if (STM32F4xx_PIN_NUMBERS == 48)
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(2, C, 13),
    __STM32_PIN(3, C, 14),
    __STM32_PIN(4, C, 15),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(10, A, 0),
    __STM32_PIN(11, A, 1),
    __STM32_PIN(12, A, 2),
    __STM32_PIN(13, A, 3),
    __STM32_PIN(14, A, 4),
    __STM32_PIN(15, A, 5),
    __STM32_PIN(16, A, 6),
    __STM32_PIN(17, A, 7),
    __STM32_PIN(18, B, 0),
    __STM32_PIN(19, B, 1),
    __STM32_PIN(20, B, 2),
    __STM32_PIN(21, B, 10),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(25, B, 12),
    __STM32_PIN(26, B, 13),
    __STM32_PIN(27, B, 14),
    __STM32_PIN(28, B, 15),
    __STM32_PIN(29, A, 8),
    __STM32_PIN(30, A, 9),
    __STM32_PIN(31, A, 10),
    __STM32_PIN(32, A, 11),
    __STM32_PIN(33, A, 12),
    __STM32_PIN(34, A, 13),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(37, A, 14),
    __STM32_PIN(38, A, 15),
    __STM32_PIN(39, B, 3),
    __STM32_PIN(40, B, 4),
    __STM32_PIN(41, B, 5),
    __STM32_PIN(42, B, 6),
    __STM32_PIN(43, B, 7),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(45, B, 8),
    __STM32_PIN(46, B, 9),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
#endif
#if (STM32F4xx_PIN_NUMBERS == 64)
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(2, C, 13),
    __STM32_PIN(3, C, 14),
    __STM32_PIN(4, C, 15),
    __STM32_PIN(5, D, 0),
    __STM32_PIN(6, D, 1),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(8, C, 0),
    __STM32_PIN(9, C, 1),
    __STM32_PIN(10, C, 2),
    __STM32_PIN(11, C, 3),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(14, A, 0),
    __STM32_PIN(15, A, 1),
    __STM32_PIN(16, A, 2),
    __STM32_PIN(17, A, 3),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(20, A, 4),
    __STM32_PIN(21, A, 5),
    __STM32_PIN(22, A, 6),
    __STM32_PIN(23, A, 7),
    __STM32_PIN(24, C, 4),
    __STM32_PIN(25, C, 5),
    __STM32_PIN(26, B, 0),
    __STM32_PIN(27, B, 1),
    __STM32_PIN(28, B, 2),
    __STM32_PIN(29, B, 10),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(33, B, 12),
    __STM32_PIN(34, B, 13),
    __STM32_PIN(35, B, 14),
    __STM32_PIN(36, B, 15),
    __STM32_PIN(37, C, 6),
    __STM32_PIN(38, C, 7),
    __STM32_PIN(39, C, 8),
    __STM32_PIN(40, C, 9),
    __STM32_PIN(41, A, 8),
    __STM32_PIN(42, A, 9),
    __STM32_PIN(43, A, 10),
    __STM32_PIN(44, A, 11),
    __STM32_PIN(45, A, 12),
    __STM32_PIN(46, A, 13),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(49, A, 14),
    __STM32_PIN(50, A, 15),
    __STM32_PIN(51, C, 10),
    __STM32_PIN(52, C, 11),
    __STM32_PIN(53, C, 12),
    __STM32_PIN(54, D, 2),
    __STM32_PIN(55, B, 3),
    __STM32_PIN(56, B, 4),
    __STM32_PIN(57, B, 5),
    __STM32_PIN(58, B, 6),
    __STM32_PIN(59, B, 7),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(61, B, 8),
    __STM32_PIN(62, B, 9),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
#endif
#if (STM32F4xx_PIN_NUMBERS == 81)
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(2, C, 10),
    __STM32_PIN(3, A, 15),
    __STM32_PIN(4, D, 0),
    __STM32_PIN(5, B, 3),
    __STM32_PIN(6, B, 5),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(11, A, 14),
    __STM32_PIN(12, A, 12),
    __STM32_PIN(13, C, 12),
    __STM32_PIN(14, B, 4),
    __STM32_PIN(15, B, 6),
    __STM32_PIN(16, B, 7),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(20, A, 13),
    __STM32_PIN(21, A, 11),
    __STM32_PIN(22, C, 11),
    __STM32_PIN(23, D, 2),
    __STM32_PIN(24, B, 8),
    __STM32_PIN(25, C, 1),
    __STM32_PIN(26, C, 13),
    __STM32_PIN(27, C, 14),
    __STM32_PIN(28, A, 10),
    __STM32_PIN(29, A, 9),
    __STM32_PIN(30, A, 8),
    __STM32_PIN(31, C, 7),
    __STM32_PIN(32, C, 6),
    __STM32_PIN(33, B, 9),
    __STM32_PIN(34, C, 2),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(36, C, 15),
    __STM32_PIN(37, C, 8),
    __STM32_PIN(38, C, 9),
    __STM32_PIN(39, B, 14),
    __STM32_PIN(40, B, 0),
    __STM32_PIN(41, A, 4),
    __STM32_PIN(42, A, 3),
    __STM32_PIN(43, C, 3),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(47, D, 9),
    __STM32_PIN(48, B, 12),
    __STM32_PIN(49, E, 13),
    __STM32_PIN(50, A, 6),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(53, C, 0),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(55, D, 10),
    __STM32_PIN(56, B, 13),
    __STM32_PIN(57, E, 14),
    __STM32_PIN(58, E, 10),
    __STM32_PIN(59, B, 1),
    __STM32_PIN(59, A, 5),
    __STM32_PIN(61, A, 0),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(64, B, 15),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(66, B, 10),
    __STM32_PIN(67, E, 11),
    __STM32_PIN(68, B, 2),
    __STM32_PIN(69, C, 4),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(71, A, 1),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(75, E, 15),
    __STM32_PIN(76, E, 12),
    __STM32_PIN(77, E, 9),
    __STM32_PIN(78, C, 5),
    __STM32_PIN(80, A, 7),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(81, A, 2),
#endif
#if (STM32F4xx_PIN_NUMBERS == 100 && !defined(STM32F469xx) && !defined(STM32F479xx))
    __STM32_PIN_DEFAULT,
    __STM32_PIN(1, E, 2),
    __STM32_PIN(2, E, 3),
    __STM32_PIN(3, E, 4),
    __STM32_PIN(4, E, 5),
    __STM32_PIN(5, E, 6),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(7, C, 13),
    __STM32_PIN(8, C, 14),
    __STM32_PIN(9, C, 15),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(15, C, 0),
    __STM32_PIN(16, C, 1),
    __STM32_PIN(17, C, 2),
    __STM32_PIN(18, C, 3),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(23, A, 0),
    __STM32_PIN(24, A, 1),
    __STM32_PIN(25, A, 2),
    __STM32_PIN(26, A, 3),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(29, A, 4),
    __STM32_PIN(30, A, 5),
    __STM32_PIN(31, A, 6),
    __STM32_PIN(32, A, 7),
    __STM32_PIN(33, C, 4),
    __STM32_PIN(34, C, 5),
    __STM32_PIN(35, B, 0),
    __STM32_PIN(36, B, 1),
    __STM32_PIN(37, B, 2),
    __STM32_PIN(38, E, 7),
    __STM32_PIN(39, E, 8),
    __STM32_PIN(40, E, 9),
    __STM32_PIN(41, E, 10),
    __STM32_PIN(42, E, 11),
    __STM32_PIN(43, E, 12),
    __STM32_PIN(44, E, 13),
    __STM32_PIN(45, E, 14),
    __STM32_PIN(46, E, 15),
    __STM32_PIN(47, B, 10),
#if defined(STM32F405xx)||defined(STM32F415xx)||defined(STM32F407xx)||defined(STM32F417xx)||defined(STM32F427xx)||defined(STM32F437xx)||defined(STM32F429xx)
    __STM32_PIN(48, B, 11),
#else
    __STM32_PIN_DEFAULT,
#endif
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(51, B, 12),
    __STM32_PIN(52, B, 13),
    __STM32_PIN(53, B, 14),
    __STM32_PIN(54, B, 15),
    __STM32_PIN(55, D, 8),
    __STM32_PIN(56, D, 9),
    __STM32_PIN(57, D, 10),
    __STM32_PIN(58, D, 11),
    __STM32_PIN(59, D, 12),
    __STM32_PIN(60, D, 13),
    __STM32_PIN(61, D, 14),
    __STM32_PIN(62, D, 15),
    __STM32_PIN(63, C, 6),
    __STM32_PIN(64, C, 7),
    __STM32_PIN(65, C, 8),
    __STM32_PIN(66, C, 9),
    __STM32_PIN(67, A, 8),
    __STM32_PIN(68, A, 9),
    __STM32_PIN(69, A, 10),
    __STM32_PIN(70, A, 11),
    __STM32_PIN(71, A, 12),
    __STM32_PIN(72, A, 13),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(76, A, 14),
    __STM32_PIN(77, A, 15),
    __STM32_PIN(78, C, 10),
    __STM32_PIN(79, C, 11),
    __STM32_PIN(80, C, 12),
    __STM32_PIN(81, D, 0),
    __STM32_PIN(82, D, 1),
    __STM32_PIN(83, D, 2),
    __STM32_PIN(84, D, 3),
    __STM32_PIN(85, D, 4),
    __STM32_PIN(86, D, 5),
    __STM32_PIN(87, D, 6),
    __STM32_PIN(88, D, 7),
    __STM32_PIN(89, B, 3),
    __STM32_PIN(90, B, 4),
    __STM32_PIN(91, B, 5),
    __STM32_PIN(92, B, 6),
    __STM32_PIN(93, B, 7),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(95, B, 8),
    __STM32_PIN(96, B, 9),
    __STM32_PIN(97, E, 0),
    __STM32_PIN(98, E, 1),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
#endif
#if (STM32F4xx_PIN_NUMBERS == 100 && (defined(STM32F469xx) || defined(STM32F479xx)))
    __STM32_PIN_DEFAULT,
    __STM32_PIN(1, E, 2),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(4, C, 13),
    __STM32_PIN(5, C, 14),
    __STM32_PIN(6, C, 15),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(12, C, 0),
    __STM32_PIN(13, C, 1),
    __STM32_PIN(14, C, 2),
    __STM32_PIN(15, C, 3),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(19, A, 0),
    __STM32_PIN(20, A, 1),
    __STM32_PIN(21, A, 2),
    __STM32_PIN(22, A, 3),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(25, A, 4),
    __STM32_PIN(26, A, 5),
    __STM32_PIN(27, A, 6),
    __STM32_PIN(28, A, 7),
    __STM32_PIN(29, B, 0),
    __STM32_PIN(30, B, 1),
    __STM32_PIN(31, B, 2),
    __STM32_PIN(32, E, 7),
    __STM32_PIN(33, E, 8),
    __STM32_PIN(34, E, 9),
    __STM32_PIN(35, E, 10),
    __STM32_PIN(36, E, 11),
    __STM32_PIN(37, E, 12),
    __STM32_PIN(38, E, 13),
    __STM32_PIN(39, E, 14),
    __STM32_PIN(40, E, 15),
    __STM32_PIN(41, B, 10),
    __STM32_PIN(42, B, 11),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(46, B, 12),
    __STM32_PIN(47, B, 13),
    __STM32_PIN(48, B, 14),
    __STM32_PIN(49, B, 15),
    __STM32_PIN(50, D, 8),
    __STM32_PIN(51, D, 9),
    __STM32_PIN(52, D, 10),
    __STM32_PIN(53, D, 14),
    __STM32_PIN(54, D, 15),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(66, C, 6),
    __STM32_PIN(67, C, 7),
    __STM32_PIN(68, C, 8),
    __STM32_PIN(69, C, 9),
    __STM32_PIN(70, A, 8),
    __STM32_PIN(71, A, 9),
    __STM32_PIN(72, A, 10),
    __STM32_PIN(73, A, 11),
    __STM32_PIN(74, A, 12),
    __STM32_PIN(75, A, 13),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(79, A, 14),
    __STM32_PIN(80, A, 15),
    __STM32_PIN(81, C, 10),
    __STM32_PIN(82, C, 11),
    __STM32_PIN(83, C, 12),
    __STM32_PIN(84, D, 0),
    __STM32_PIN(85, D, 1),
    __STM32_PIN(86, D, 2),
    __STM32_PIN(87, D, 3),
    __STM32_PIN(88, D, 4),
    __STM32_PIN(89, D, 5),
    __STM32_PIN(90, D, 6),
    __STM32_PIN(91, D, 7),
    __STM32_PIN(92, B, 3),
    __STM32_PIN(93, B, 4),
    __STM32_PIN(94, B, 5),
    __STM32_PIN(95, B, 6),
    __STM32_PIN(96, B, 7),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(98, B, 8),
    __STM32_PIN(99, B, 9),
    __STM32_PIN_DEFAULT,
#endif
#if (STM32F4xx_PIN_NUMBERS == 144)
    __STM32_PIN_DEFAULT,
    __STM32_PIN(1, E, 2),
    __STM32_PIN(2, E, 3),
    __STM32_PIN(3, E, 4),
    __STM32_PIN(4, E, 5),
    __STM32_PIN(5, E, 6),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(7, C, 13),
    __STM32_PIN(8, C, 14),
    __STM32_PIN(9, C, 15),
    __STM32_PIN(10, F, 0),
    __STM32_PIN(11, F, 1),
    __STM32_PIN(12, F, 2),
    __STM32_PIN(13, F, 3),
    __STM32_PIN(14, F, 4),
    __STM32_PIN(15, F, 5),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(18, F, 6),
    __STM32_PIN(19, F, 7),
    __STM32_PIN(20, F, 8),
    __STM32_PIN(21, F, 9),
    __STM32_PIN(22, F, 10),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(26, C, 0),
    __STM32_PIN(27, C, 1),
    __STM32_PIN(28, C, 2),
    __STM32_PIN(29, C, 3),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(34, A, 0),
    __STM32_PIN(35, A, 1),
    __STM32_PIN(36, A, 2),
    __STM32_PIN(37, A, 3),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(40, A, 4),
    __STM32_PIN(41, A, 5),
    __STM32_PIN(42, A, 6),
    __STM32_PIN(43, A, 7),
    __STM32_PIN(44, C, 4),
    __STM32_PIN(45, C, 5),
    __STM32_PIN(46, B, 0),
    __STM32_PIN(47, B, 1),
    __STM32_PIN(48, B, 2),
    __STM32_PIN(49, F, 11),
    __STM32_PIN(50, F, 12),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(53, F, 13),
    __STM32_PIN(54, F, 14),
    __STM32_PIN(55, F, 15),
    __STM32_PIN(56, G, 0),
    __STM32_PIN(57, G, 1),
    __STM32_PIN(58, E, 7),
    __STM32_PIN(59, E, 8),
    __STM32_PIN(60, E, 9),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(63, E, 10),
    __STM32_PIN(64, E, 11),
    __STM32_PIN(65, E, 12),
    __STM32_PIN(66, E, 13),
    __STM32_PIN(67, E, 14),
    __STM32_PIN(68, E, 15),
    __STM32_PIN(69, B, 10),
    __STM32_PIN(70, B, 11),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(73, B, 12),
    __STM32_PIN(74, B, 13),
    __STM32_PIN(75, B, 14),
    __STM32_PIN(76, B, 15),
    __STM32_PIN(77, D, 8),
    __STM32_PIN(78, D, 9),
    __STM32_PIN(79, D, 10),
    __STM32_PIN(80, D, 11),
    __STM32_PIN(81, D, 12),
    __STM32_PIN(82, D, 13),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(85, D, 14),
    __STM32_PIN(86, D, 15),
    __STM32_PIN(87, G, 2),
    __STM32_PIN(88, G, 3),
    __STM32_PIN(89, G, 4),
    __STM32_PIN(90, G, 5),
    __STM32_PIN(91, G, 6),
    __STM32_PIN(92, G, 7),
    __STM32_PIN(93, G, 8),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(96, C, 6),
    __STM32_PIN(97, C, 7),
    __STM32_PIN(98, C, 8),
    __STM32_PIN(99, C, 9),
    __STM32_PIN(100, A, 8),
    __STM32_PIN(101, A, 9),
    __STM32_PIN(102, A, 10),
    __STM32_PIN(103, A, 11),
    __STM32_PIN(104, A, 12),
    __STM32_PIN(105, A, 13),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(109, A, 14),
    __STM32_PIN(110, A, 15),
    __STM32_PIN(111, C, 10),
    __STM32_PIN(112, C, 11),
    __STM32_PIN(113, C, 12),
    __STM32_PIN(114, D, 0),
    __STM32_PIN(115, D, 1),
    __STM32_PIN(116, D, 2),
    __STM32_PIN(117, D, 3),
    __STM32_PIN(118, D, 4),
    __STM32_PIN(119, D, 5),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(122, D, 6),
    __STM32_PIN(123, D, 7),
    __STM32_PIN(124, G, 9),
    __STM32_PIN(125, G, 10),
    __STM32_PIN(126, G, 11),
    __STM32_PIN(127, G, 12),
    __STM32_PIN(128, G, 13),
    __STM32_PIN(129, G, 14),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(132, G, 15),
    __STM32_PIN(133, B, 3),
    __STM32_PIN(134, B, 4),
    __STM32_PIN(135, B, 5),
    __STM32_PIN(136, B, 6),
    __STM32_PIN(137, B, 7),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(139, B, 8),
    __STM32_PIN(140, B, 9),
    __STM32_PIN(141, E, 0),
    __STM32_PIN(142, E, 1),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
#endif
#if (STM32F4xx_PIN_NUMBERS == 169)
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(2, I, 6),
    __STM32_PIN(3, I, 5),
    __STM32_PIN(4, E, 1),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(6, B, 4),
    __STM32_PIN(7, G, 12),
    __STM32_PIN(8, D, 7),
    __STM32_PIN(9, D, 3),
    __STM32_PIN(10, C, 12),
    __STM32_PIN(11, A, 14),
    __STM32_PIN(12, I, 3),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(14, I, 7),
    __STM32_PIN(15, E, 2),
    __STM32_PIN(16, I, 4),
    __STM32_PIN(17, E, 0),
    __STM32_PIN(18, B, 7),
    __STM32_PIN(19, B, 3),
    __STM32_PIN(20, G, 11),
    __STM32_PIN(21, D, 6),
    __STM32_PIN(22, D, 2),
    __STM32_PIN(23, C, 11),
    __STM32_PIN(24, A, 15),
    __STM32_PIN(25, I, 2),
    __STM32_PIN(26, I, 0),
    __STM32_PIN(27, E, 3),
    __STM32_PIN(28, E, 4),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(30, B, 9),
    __STM32_PIN(31, B, 6),
    __STM32_PIN(32, G, 15),
    __STM32_PIN(33, G, 10),
    __STM32_PIN(34, D, 5),
    __STM32_PIN(35, D, 1),
    __STM32_PIN(36, C, 10),
    __STM32_PIN(37, I, 1),
    __STM32_PIN(38, H, 15),
    __STM32_PIN(39, H, 14),
    __STM32_PIN(40, E, 5),
    __STM32_PIN(41, E, 6),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(43, B, 8),
    __STM32_PIN(44, B, 5),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(47, D, 4),
    __STM32_PIN(48, D, 0),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(52, H, 13),
    __STM32_PIN(53, C, 14),
    __STM32_PIN(54, I, 9),
    __STM32_PIN(55, I, 10),
    __STM32_PIN(56, C, 13),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(60, A, 9),
    __STM32_PIN(61, A, 10),
    __STM32_PIN(62, A, 11),
    __STM32_PIN(63, A, 12),
    __STM32_PIN(64, A, 13),
    __STM32_PIN(65, A, 8),
    __STM32_PIN(66, C, 15),
    __STM32_PIN(67, F, 0),
    __STM32_PIN(68, F, 1),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(74, C, 6),
    __STM32_PIN(75, C, 7),
    __STM32_PIN(76, C, 8),
    __STM32_PIN(77, C, 9),
    __STM32_PIN(78, G, 8),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(81, F, 4),
    __STM32_PIN(82, F, 3),
    __STM32_PIN(83, F, 2),
    __STM32_PIN(84, C, 0),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(89, G, 6),
    __STM32_PIN(90, G, 7),
    __STM32_PIN(91, G, 5),
    __STM32_PIN(92, F, 10),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(94, F, 5),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(96, C, 1),
    __STM32_PIN(97, C, 2),
    __STM32_PIN(98, C, 3),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(100, E, 13),
    __STM32_PIN(101, D, 11),
    __STM32_PIN(102, D, 14),
    __STM32_PIN(103, G, 4),
    __STM32_PIN(104, G, 2),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(109, A, 0),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(112, E, 8),
    __STM32_PIN(113, E, 14),
    __STM32_PIN_DEFAULT,
    __STM32_PIN_DEFAULT,
    __STM32_PIN(116, D, 15),
    __STM32_PIN(117, D, 12),
    __STM32_PIN(118, A, 1),
    __STM32_PIN(119, A, 2),
    __STM32_PIN(120, A, 3),
    __STM32_PIN(121, A, 7),
    __STM32_PIN(122, B, 1),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(124, F, 14),
    __STM32_PIN(125, E, 9),
    __STM32_PIN(126, E, 15),
    __STM32_PIN(127, H, 9),
    __STM32_PIN(128, D, 10),
    __STM32_PIN(129, D, 13),
    __STM32_PIN(130, D, 9),
    __STM32_PIN(131, H, 3),
    __STM32_PIN(132, H, 2),
    __STM32_PIN(133, H, 5),
    __STM32_PIN(134, C, 4),
    __STM32_PIN(135, B, 2),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(137, F, 15),
    __STM32_PIN(138, E, 10),
    __STM32_PIN(139, B, 10),
    __STM32_PIN(140, H, 8),
    __STM32_PIN(141, H, 12),
    __STM32_PIN(142, D, 8),
    __STM32_PIN(143, B, 15),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(145, H, 4),
    __STM32_PIN(146, A, 5),
    __STM32_PIN(147, C, 5),
    __STM32_PIN(148, F, 11),
    __STM32_PIN(149, F, 13),
    __STM32_PIN(150, G, 1),
    __STM32_PIN(151, E, 11),
    __STM32_PIN(152, B, 11),
    __STM32_PIN(153, H, 7),
    __STM32_PIN(154, H, 11),
    __STM32_PIN(155, B, 13),
    __STM32_PIN(156, B, 14),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(158, A, 4),
    __STM32_PIN(159, A, 6),
    __STM32_PIN(160, B, 0),
    __STM32_PIN(161, F, 12),
    __STM32_PIN(162, G, 0),
    __STM32_PIN(163, E, 7),
    __STM32_PIN(164, E, 12),
    __STM32_PIN_DEFAULT,
    __STM32_PIN(166, E, 12),
    __STM32_PIN(167, H, 10),
    __STM32_PIN(168, B, 12),
    __STM32_PIN_DEFAULT,
#endif
#if (STM32F4xx_PIN_NUMBERS == 176)
    __STM32_PIN_DEFAULT,
    __STM32_PIN(1, E, 2),
