zzshm-tech/tbox/SM_T_GB4_STM32F4_HJ1322/bsp/stm32f4xx-HAL/drivers/drv_gpio.c
void EXTI0_IRQHandler(void)
{
    rt_interrupt_enter();
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_0);
    rt_interrupt_leave();
}

void EXTI1_IRQHandler(void)
{
    rt_interrupt_enter();
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_1);
    rt_interrupt_leave();
}

void EXTI2_IRQHandler(void)
{
    rt_interrupt_enter();
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_2);
    rt_interrupt_leave();
}

void EXTI3_IRQHandler(void)
{
    rt_interrupt_enter();
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_3);
    rt_interrupt_leave();
}






void EXTI4_IRQHandler(void)
{
    rt_interrupt_enter();
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_4);
    rt_interrupt_leave();
}

void EXTI9_5_IRQHandler(void)
{
    rt_interrupt_enter();
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_5);
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_6);
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_7);
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_8);
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_9);
    rt_interrupt_leave();
}

void EXTI15_10_IRQHandler(void)
{
    rt_interrupt_enter();
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_10);
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_11);
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_12);
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_13);
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_14);
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_15);
    rt_interrupt_leave();
}
#endif



/*******************************
**	IO初始化
*********************************/

int rt_hw_gpio_init(void)
{
//	__HAL_RCC_GPIOA_CLK_ENABLE();
//	__HAL_RCC_GPIOB_CLK_ENABLE();
//	__HAL_RCC_GPIOC_CLK_ENABLE();
//	__HAL_RCC_GPIOD_CLK_ENABLE();
//  __HAL_RCC_GPIOE_CLK_ENABLE();
  
	rt_pin_mode(LED_YELLOW_PIN,PIN_MODE_OUTPUT);
  rt_pin_mode(LED_GREEN_PIN,PIN_MODE_OUTPUT);
	rt_pin_mode(LED_BLUE_PIN,PIN_MODE_OUTPUT);
	rt_pin_mode(LED_RED_PIN,PIN_MODE_OUTPUT);
	
  rt_led_yellow_off();
  rt_led_blue_off();
	rt_led_green_off();
	rt_led_red_off();
    
	/***RS232 电源控制接口**/
	rt_pin_mode(PIN_RS232_POWER,	PIN_MODE_OUTPUT);     //
	rt_rs232_power_off();


	/***CAN 控制接口**/
	rt_pin_mode(PIN_CAN_POWER,PIN_MODE_OUTPUT);
	rt_can_power_on();
	
	rt_pin_mode(PIN_CAN1_STB,	PIN_MODE_OUTPUT);     //
	rt_can1_stb_on();

	rt_pin_mode(PIN_CAN2_STB,	PIN_MODE_OUTPUT);     //
	rt_can2_stb_off();


	/***GNSS 控制接口**/

	rt_pin_mode(PIN_GNSS_POWER,	PIN_MODE_OUTPUT);     //
	rt_gnss_power_off();
	
//	rt_pin_mode(PIN_GNSS_VBACK,	PIN_MODE_OUTPUT);     //
//	rt_gnss_vback_off();

	/***LTE 控制接口**/

	rt_pin_mode(PIN_LTE_POWER,	PIN_MODE_OUTPUT);     //
	rt_lte_power_off();
	rt_pin_mode(PIN_LTE_PWK  ,	PIN_MODE_OUTPUT);     //
	rt_lte_pwk_low();
	
	rt_pin_mode(PIN_GPIO_BLUE_TOOTH_POWER,PIN_MODE_OUTPUT);
	rt_power_bt_off();
	rt_pin_mode(PIN_GPIO_BLUE_TOOTH_CONNECT,PIN_MODE_INPUT_PULLDOWN);
	
	rt_pin_mode(PIN_GPIO_BLUE_TOOTH_CMD,PIN_MODE_OUTPUT);
	rt_bt_mode_not_at();

	/**Flash Mem And EMMC 电源接口**/
	rt_pin_mode(PIN_MEM_POWER,	PIN_MODE_OUTPUT);     //
	rt_mem_power_on();
	//rt_mem_power_off();
	
	rt_pin_mode(PIN_BT_POWER,PIN_MODE_INPUT);
	rt_bt_power_off();
	
	//rt_pin_mode(PIN_BAT_STDBY,	PIN_MODE_INPUT);     				//充电芯片STDBY引脚采集
	rt_pin_mode(PIN_MOTO_STATE,PIN_MODE_INPUT);     //MOTO
	rt_pin_mode(PIN_ACC_STATE,PIN_MODE_INPUT);     //ACC
	rt_pin_mode(PIN_DI_1_STATE,PIN_MODE_INPUT);     //DI-1
	rt_pin_mode(PIN_DI_2_STATE,PIN_MODE_INPUT);     //DI-2
	
	rt_pin_mode(PIN_EEP_WP,PIN_MODE_OUTPUT);        /** EEPROM WP PIN **/
	rt_eep_wp_low();
	
	rt_pin_mode(70,  			PIN_MODE_INPUT);    /** USB_H **/
	rt_pin_mode(71,  			PIN_MODE_INPUT);    /** USB_L **/
	
	rt_pin_mode(42,PIN_MODE_INPUT);        /**CMD_STA**/
	rt_pin_mode(43,PIN_MODE_INPUT);        /**C_NECT_STA**/
	rt_pin_mode(46,PIN_MODE_INPUT);        /**PBT_POWER_CONTROL**/
	
	rt_pin_mode(63,PIN_MODE_INPUT);        /**BT_RX**/
	rt_pin_mode(64,PIN_MODE_INPUT);        /**BT_TX**/
	
	rt_pin_mode(36,PIN_MODE_INPUT);        /** VERSION_CONTROL **/
	
//	rt_pin_mode(65,PIN_MODE_INPUT);        /**eMMC_DAT0**/
//	rt_pin_mode(66,PIN_MODE_INPUT);        /**eMMC_DAT1**/
//	rt_pin_mode(78,PIN_MODE_INPUT);        /**eMMC_DAT2**/
//	rt_pin_mode(79,PIN_MODE_INPUT);        /**eMMC_DAT3**/
//	rt_pin_mode(80,PIN_MODE_INPUT);        /**eMMC_SCK**/
//	
//	rt_pin_mode(83,PIN_MODE_INPUT);        /**eMMC_CMD**/
//	rt_pin_mode(84,PIN_MODE_INPUT);        /**eMMC_RST**/
	
	rt_pin_mode(57,PIN_MODE_INPUT);        /**ACL_WAK**/
	rt_pin_mode(58,PIN_MODE_INPUT);        /**ACL_RSTN**/
	
	rt_pin_mode(61,PIN_MODE_INPUT);        /**GYRO_INT1**/
	rt_pin_mode(62,PIN_MODE_INPUT);        /**GYRO_INT2**/
	rt_pin_mode(97,PIN_MODE_INPUT);        /**PWM_IN1**/
	
	rt_pin_mode(93,PIN_MODE_INPUT);        /**BMI055_SDA**/
	rt_pin_mode(95,PIN_MODE_INPUT);        /**BMI055_SCK**/
	
	rt_pin_mode(51,PIN_MODE_INPUT);        /**ACL_SPI_CS**/
	rt_pin_mode(52,PIN_MODE_INPUT);        /**ACL_SPI_CLK**/
	rt_pin_mode(53,PIN_MODE_INPUT);        /**ACL_SPI_MISO**/
	rt_pin_mode(54,PIN_MODE_INPUT);        /**ACL_SPI_MOSI**/
	
	
	
	return 0;
}



int rt_hw_gpio_close(void)
{
	//关闭SPI1端口
	rt_pin_mode(29,PIN_MODE_INPUT);        /**W25Q64_SPI_CS**/
	rt_pin_mode(30,PIN_MODE_INPUT);        /**W25Q64_SPI_CLK**/
	rt_pin_mode(31,PIN_MODE_INPUT);        /**W25Q64_SPI_MISO**/
	rt_pin_mode(32,PIN_MODE_INPUT);        /**W25Q64_SPI_MOSI**/
	
	rt_pin_mode(57,PIN_MODE_INPUT);        /**ACL_WAK**/
	rt_pin_mode(58,PIN_MODE_INPUT);        /**ACL_RSTN**/
	rt_pin_mode(51,PIN_MODE_INPUT);        /**ACL_SPI_CS**/
	rt_pin_mode(52,PIN_MODE_INPUT);        /**ACL_SPI_CLK**/
	rt_pin_mode(53,PIN_MODE_INPUT);        /**ACL_SPI_MISO**/
	rt_pin_mode(54,PIN_MODE_INPUT);        /**ACL_SPI_MOSI**/
	
	rt_pin_mode(65,PIN_MODE_INPUT);        /**eMMC_DAT0**/
	rt_pin_mode(66,PIN_MODE_INPUT);        /**eMMC_DAT1**/
	rt_pin_mode(78,PIN_MODE_INPUT);        /**eMMC_DAT2**/
	rt_pin_mode(79,PIN_MODE_INPUT);        /**eMMC_DAT3**/
	rt_pin_mode(80,PIN_MODE_INPUT);        /**eMMC_SCK**/
	rt_pin_mode(83,PIN_MODE_INPUT);        /**eMMC_CMD**/
	rt_pin_mode(84,PIN_MODE_INPUT);        /**eMMC_RST**/
	
	rt_pin_mode(39,PIN_MODE_INPUT);        /** EEP_W_P **/
	rt_pin_mode(47,PIN_MODE_INPUT);        /** EEP_SCL **/
	rt_pin_mode(48,PIN_MODE_INPUT);        /** EEP_SDA **/
	
//	rt_pin_mode(81,PIN_MODE_INPUT);        /** CAN1_RX **/
//	rt_pin_mode(82,PIN_MODE_INPUT);        /** CAN1_TX **/
//	rt_pin_mode(91,PIN_MODE_INPUT);        /** CAN2_RX **/
//	rt_pin_mode(92,PIN_MODE_INPUT);        /** CAN2_TX **/
//	
//	rt_pin_mode(2,PIN_MODE_INPUT);        /** CAN1_STB **/
//	rt_pin_mode(4,PIN_MODE_INPUT);        /** CAN2_STB **/

//	rt_pin_mode(23,PIN_MODE_INPUT);        /** LTE_RX **/
//	rt_pin_mode(24,PIN_MODE_INPUT);        /** LTE_TX **/
	rt_pin_mode(25,PIN_MODE_INPUT);        /** LTE_RST **/
	rt_pin_mode(26,PIN_MODE_INPUT);        /** LTE_PWK **/
//	
//	rt_pin_mode(68,PIN_MODE_INPUT);        /** RS232_RX **/
//	rt_pin_mode(69,PIN_MODE_INPUT);        /** RS232_TX **/
//	rt_pin_mode(67,PIN_MODE_INPUT);        /** RS232_SHDN **/

	rt_pin_mode(96,PIN_MODE_INPUT);        /** LTE_PWK **/
	
	rt_pin_mode(63,PIN_MODE_INPUT);        /** BT_RX **/
	rt_pin_mode(64,PIN_MODE_INPUT);        /** BT_TX **/
	rt_pin_mode(42,PIN_MODE_INPUT);        /**BT_NECT_STA**/
	rt_pin_mode(43,PIN_MODE_INPUT);        /**BT_MODEL_CONTROL**/
	rt_pin_mode(46,PIN_MODE_INPUT);        /**BT_MODEL_CONTROL**/
	
	//rt_gnss_vback_off();
	return 0;
}

